; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-4-6-5)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	p0-1 - location
	p1-2 - location
	p1-4 - location
	p2-4 - location
	p2-7 - location
	p3-5 - location
	p4-0 - location
	p4-5 - location
	p5-0 - location
	p6-4 - location
	p7-0 - location
	p7-3 - location
	p7-6 - location
	)
	(:init
	(at driver1 s1)
	(at driver2 s5)
	(at driver3 s6)
	(at driver4 s5)
	(at truck1 s4)
	(empty truck1)
	(at truck2 s3)
	(empty truck2)
	(at truck3 s1)
	(empty truck3)
	(at truck4 s5)
	(empty truck4)
	(at truck5 s5)
	(empty truck5)
	(at truck6 s7)
	(empty truck6)
	(at package1 s7)
	(at package2 s7)
	(at package3 s6)
	(at package4 s1)
	(at package5 s7)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(= (time-to-walk s0 p0-1) 52)
	(= (time-to-walk p0-1 s0) 52)
	(= (time-to-walk s1 p0-1) 7)
	(= (time-to-walk p0-1 s1) 7)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(= (time-to-walk s1 p1-2) 81)
	(= (time-to-walk p1-2 s1) 81)
	(= (time-to-walk s2 p1-2) 95)
	(= (time-to-walk p1-2 s2) 95)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(= (time-to-walk s1 p1-4) 32)
	(= (time-to-walk p1-4 s1) 32)
	(= (time-to-walk s4 p1-4) 21)
	(= (time-to-walk p1-4 s4) 21)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(= (time-to-walk s2 p2-4) 45)
	(= (time-to-walk p2-4 s2) 45)
	(= (time-to-walk s4 p2-4) 98)
	(= (time-to-walk p2-4 s4) 98)
	(path s2 p2-7)
	(path p2-7 s2)
	(path s7 p2-7)
	(path p2-7 s7)
	(= (time-to-walk s2 p2-7) 57)
	(= (time-to-walk p2-7 s2) 57)
	(= (time-to-walk s7 p2-7) 96)
	(= (time-to-walk p2-7 s7) 96)
	(path s3 p3-5)
	(path p3-5 s3)
	(path s5 p3-5)
	(path p3-5 s5)
	(= (time-to-walk s3 p3-5) 67)
	(= (time-to-walk p3-5 s3) 67)
	(= (time-to-walk s5 p3-5) 99)
	(= (time-to-walk p3-5 s5) 99)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(= (time-to-walk s4 p4-0) 60)
	(= (time-to-walk p4-0 s4) 60)
	(= (time-to-walk s0 p4-0) 66)
	(= (time-to-walk p4-0 s0) 66)
	(path s4 p4-5)
	(path p4-5 s4)
	(path s5 p4-5)
	(path p4-5 s5)
	(= (time-to-walk s4 p4-5) 65)
	(= (time-to-walk p4-5 s4) 65)
	(= (time-to-walk s5 p4-5) 92)
	(= (time-to-walk p4-5 s5) 92)
	(path s5 p5-0)
	(path p5-0 s5)
	(path s0 p5-0)
	(path p5-0 s0)
	(= (time-to-walk s5 p5-0) 54)
	(= (time-to-walk p5-0 s5) 54)
	(= (time-to-walk s0 p5-0) 53)
	(= (time-to-walk p5-0 s0) 53)
	(path s6 p6-4)
	(path p6-4 s6)
	(path s4 p6-4)
	(path p6-4 s4)
	(= (time-to-walk s6 p6-4) 97)
	(= (time-to-walk p6-4 s6) 97)
	(= (time-to-walk s4 p6-4) 53)
	(= (time-to-walk p6-4 s4) 53)
	(path s7 p7-0)
	(path p7-0 s7)
	(path s0 p7-0)
	(path p7-0 s0)
	(= (time-to-walk s7 p7-0) 14)
	(= (time-to-walk p7-0 s7) 14)
	(= (time-to-walk s0 p7-0) 43)
	(= (time-to-walk p7-0 s0) 43)
	(path s7 p7-3)
	(path p7-3 s7)
	(path s3 p7-3)
	(path p7-3 s3)
	(= (time-to-walk s7 p7-3) 31)
	(= (time-to-walk p7-3 s7) 31)
	(= (time-to-walk s3 p7-3) 59)
	(= (time-to-walk p7-3 s3) 59)
	(path s7 p7-6)
	(path p7-6 s7)
	(path s6 p7-6)
	(path p7-6 s6)
	(= (time-to-walk s7 p7-6) 61)
	(= (time-to-walk p7-6 s7) 61)
	(= (time-to-walk s6 p7-6) 48)
	(= (time-to-walk p7-6 s6) 48)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 70)
	(= (time-to-drive s1 s0) 70)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 100)
	(= (time-to-drive s2 s0) 100)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 47)
	(= (time-to-drive s3 s0) 47)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 38)
	(= (time-to-drive s2 s1) 38)
	(link s1 s4)
	(link s4 s1)
	(= (time-to-drive s1 s4) 31)
	(= (time-to-drive s4 s1) 31)
	(link s1 s6)
	(link s6 s1)
	(= (time-to-drive s1 s6) 98)
	(= (time-to-drive s6 s1) 98)
	(link s3 s2)
	(link s2 s3)
	(= (time-to-drive s3 s2) 45)
	(= (time-to-drive s2 s3) 45)
	(link s3 s7)
	(link s7 s3)
	(= (time-to-drive s3 s7) 12)
	(= (time-to-drive s7 s3) 12)
	(link s4 s5)
	(link s5 s4)
	(= (time-to-drive s4 s5) 93)
	(= (time-to-drive s5 s4) 93)
	(link s4 s7)
	(link s7 s4)
	(= (time-to-drive s4 s7) 76)
	(= (time-to-drive s7 s4) 76)
	(link s5 s0)
	(link s0 s5)
	(= (time-to-drive s5 s0) 33)
	(= (time-to-drive s0 s5) 33)
	(link s5 s3)
	(link s3 s5)
	(= (time-to-drive s5 s3) 37)
	(= (time-to-drive s3 s5) 37)
	(link s6 s0)
	(link s0 s6)
	(= (time-to-drive s6 s0) 73)
	(= (time-to-drive s0 s6) 73)
	(link s6 s4)
	(link s4 s6)
	(= (time-to-drive s6 s4) 89)
	(= (time-to-drive s4 s6) 89)
	(link s7 s0)
	(link s0 s7)
	(= (time-to-drive s7 s0) 32)
	(= (time-to-drive s0 s7) 32)
	(link s7 s2)
	(link s2 s7)
	(= (time-to-drive s7 s2) 39)
	(= (time-to-drive s2 s7) 39)
	(link s7 s5)
	(link s5 s7)
	(= (time-to-drive s7 s5) 87)
	(= (time-to-drive s5 s7) 87)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver2 s3)
	(at driver3 s5)
	(at driver4 s1)
	(at truck1 s7)
	(at truck2 s3)
	(at truck3 s3)
	(at truck4 s2)
	(at truck5 s3)
	(at truck6 s5)
	(at package2 s4)
	(at package3 s3)
	(at package4 s0)
	(at package5 s5)
	))

(:metric minimize (+ (+ (* 4  (total-time)) (* 1  (driven))) (* 3  (walked))))

)

; plan
1. (board-truck driver4 truck5 s5)
   deleted: (at driver4 s5) (empty truck5)
   added: (driving driver4 truck5)
   goals met: 1 of 13
2. (drive-truck truck5 s5 s4 driver4)
   deleted: (at truck5 s5)
   added: (at truck5 s4)
   changed: (driven) from 0 to 93
   goals met: 1 of 13
3. (load-truck package4 truck3 s1)
   deleted: (at package4 s1)
   added: (in package4 truck3)
   goals met: 1 of 13
4. (board-truck driver2 truck4 s5)
   deleted: (at driver2 s5) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 1 of 13
5. (drive-truck truck4 s5 s7 driver2)
   deleted: (at truck4 s5)
   added: (at truck4 s7)
   changed: (driven) from 93 to 180
   goals met: 1 of 13
6. (board-truck driver1 truck3 s1)
   deleted: (at driver1 s1) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 1 of 13
7. (drive-truck truck3 s1 s0 driver1)
   deleted: (at truck3 s1)
   added: (at truck3 s0)
   changed: (driven) from 180 to 250
   goals met: 1 of 13
8. (unload-truck package4 truck3 s0)
   deleted: (in package4 truck3)
   added: (at package4 s0)
   goals met: 2 of 13
9. (drive-truck truck3 s0 s3 driver1)
   deleted: (at truck3 s0)
   added: (at truck3 s3)
   changed: (driven) from 250 to 297
   goals met: 3 of 13
10. (disembark-truck driver2 truck4 s7)
   deleted: (driving driver2 truck4)
   added: (at driver2 s7) (empty truck4)
   goals met: 3 of 13
11. (board-truck driver2 truck6 s7)
   deleted: (at driver2 s7) (empty truck6)
   added: (driving driver2 truck6)
   goals met: 3 of 13
12. (load-truck package2 truck6 s7)
   deleted: (at package2 s7)
   added: (in package2 truck6)
   goals met: 3 of 13
13. (load-truck package5 truck6 s7)
   deleted: (at package5 s7)
   added: (in package5 truck6)
   goals met: 3 of 13
14. (drive-truck truck6 s7 s5 driver2)
   deleted: (at truck6 s7)
   added: (at truck6 s5)
   changed: (driven) from 297 to 384
   goals met: 4 of 13
15. (drive-truck truck5 s4 s1 driver4)
   deleted: (at truck5 s4)
   added: (at truck5 s1)
   changed: (driven) from 384 to 415
   goals met: 4 of 13
16. (disembark-truck driver4 truck5 s1)
   deleted: (driving driver4 truck5)
   added: (at driver4 s1) (empty truck5)
   goals met: 5 of 13
17. (walk driver3 s6 p6-4)
   deleted: (at driver3 s6)
   added: (at driver3 p6-4)
   changed: (walked) from 0 to 97
   goals met: 5 of 13
18. (unload-truck package5 truck6 s5)
   deleted: (in package5 truck6)
   added: (at package5 s5)
   goals met: 6 of 13
19. (walk driver3 p6-4 s4)
   deleted: (at driver3 p6-4)
   added: (at driver3 s4)
   changed: (walked) from 97 to 150
   goals met: 6 of 13
20. (board-truck driver3 truck1 s4)
   deleted: (at driver3 s4) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 6 of 13
21. (drive-truck truck1 s4 s7 driver3)
   deleted: (at truck1 s4)
   added: (at truck1 s7)
   changed: (driven) from 415 to 491
   goals met: 7 of 13
22. (board-truck driver4 truck5 s1)
   deleted: (at driver4 s1) (empty truck5)
   added: (driving driver4 truck5)
   goals met: 6 of 13
23. (disembark-truck driver3 truck1 s7)
   deleted: (driving driver3 truck1)
   added: (at driver3 s7) (empty truck1)
   goals met: 6 of 13
24. (board-truck driver3 truck4 s7)
   deleted: (at driver3 s7) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 6 of 13
25. (drive-truck truck5 s1 s6 driver4)
   deleted: (at truck5 s1)
   added: (at truck5 s6)
   changed: (driven) from 491 to 589
   goals met: 6 of 13
26. (load-truck package3 truck5 s6)
   deleted: (at package3 s6)
   added: (in package3 truck5)
   goals met: 6 of 13
27. (drive-truck truck5 s6 s0 driver4)
   deleted: (at truck5 s6)
   added: (at truck5 s0)
   changed: (driven) from 589 to 662
   goals met: 6 of 13
28. (drive-truck truck6 s5 s4 driver2)
   deleted: (at truck6 s5)
   added: (at truck6 s4)
   changed: (driven) from 662 to 755
   goals met: 5 of 13
29. (unload-truck package2 truck6 s4)
   deleted: (in package2 truck6)
   added: (at package2 s4)
   goals met: 6 of 13
30. (drive-truck truck6 s4 s5 driver2)
   deleted: (at truck6 s4)
   added: (at truck6 s5)
   changed: (driven) from 755 to 848
   goals met: 7 of 13
31. (drive-truck truck6 s5 s3 driver2)
   deleted: (at truck6 s5)
   added: (at truck6 s3)
   changed: (driven) from 848 to 885
   goals met: 6 of 13
32. (drive-truck truck4 s7 s5 driver3)
   deleted: (at truck4 s7)
   added: (at truck4 s5)
   changed: (driven) from 885 to 972
   goals met: 6 of 13
33. (disembark-truck driver3 truck4 s5)
   deleted: (driving driver3 truck4)
   added: (at driver3 s5) (empty truck4)
   goals met: 7 of 13
34. (drive-truck truck5 s0 s3 driver4)
   deleted: (at truck5 s0)
   added: (at truck5 s3)
   changed: (driven) from 972 to 1019
   goals met: 8 of 13
35. (unload-truck package3 truck5 s3)
   deleted: (in package3 truck5)
   added: (at package3 s3)
   goals met: 9 of 13
36. (drive-truck truck6 s3 s5 driver2)
   deleted: (at truck6 s3)
   added: (at truck6 s5)
   changed: (driven) from 1019 to 1056
   goals met: 10 of 13
37. (drive-truck truck5 s3 s2 driver4)
   deleted: (at truck5 s3)
   added: (at truck5 s2)
   changed: (driven) from 1056 to 1101
   goals met: 9 of 13
38. (board-truck driver3 truck4 s5)
   deleted: (at driver3 s5) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 8 of 13
39. (drive-truck truck4 s5 s3 driver3)
   deleted: (at truck4 s5)
   added: (at truck4 s3)
   changed: (driven) from 1101 to 1138
   goals met: 8 of 13
40. (drive-truck truck5 s2 s3 driver4)
   deleted: (at truck5 s2)
   added: (at truck5 s3)
   changed: (driven) from 1138 to 1183
   goals met: 9 of 13
41. (disembark-truck driver3 truck4 s3)
   deleted: (driving driver3 truck4)
   added: (at driver3 s3) (empty truck4)
   goals met: 9 of 13
42. (drive-truck truck6 s5 s3 driver2)
   deleted: (at truck6 s5)
   added: (at truck6 s3)
   changed: (driven) from 1183 to 1220
   goals met: 8 of 13
43. (disembark-truck driver2 truck6 s3)
   deleted: (driving driver2 truck6)
   added: (at driver2 s3) (empty truck6)
   goals met: 9 of 13
44. (walk driver3 s3 p3-5)
   deleted: (at driver3 s3)
   added: (at driver3 p3-5)
   changed: (walked) from 150 to 217
   goals met: 9 of 13
45. (walk driver3 p3-5 s5)
   deleted: (at driver3 p3-5)
   added: (at driver3 s5)
   changed: (walked) from 217 to 316
   goals met: 10 of 13
46. (drive-truck truck5 s3 s0 driver4)
   deleted: (at truck5 s3)
   added: (at truck5 s0)
   changed: (driven) from 1220 to 1267
   goals met: 9 of 13
47. (board-truck driver2 truck6 s3)
   deleted: (at driver2 s3) (empty truck6)
   added: (driving driver2 truck6)
   goals met: 8 of 13
48. (disembark-truck driver1 truck3 s3)
   deleted: (driving driver1 truck3)
   added: (at driver1 s3) (empty truck3)
   goals met: 8 of 13
49. (drive-truck truck5 s0 s3 driver4)
   deleted: (at truck5 s0)
   added: (at truck5 s3)
   changed: (driven) from 1267 to 1314
   goals met: 9 of 13
50. (disembark-truck driver2 truck6 s3)
   deleted: (driving driver2 truck6)
   added: (at driver2 s3) (empty truck6)
   goals met: 10 of 13
51. (board-truck driver1 truck6 s3)
   deleted: (at driver1 s3) (empty truck6)
   added: (driving driver1 truck6)
   goals met: 10 of 13
52. (drive-truck truck6 s3 s5 driver1)
   deleted: (at truck6 s3)
   added: (at truck6 s5)
   changed: (driven) from 1314 to 1351
   goals met: 11 of 13
53. (board-truck driver2 truck4 s3)
   deleted: (at driver2 s3) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 10 of 13
54. (disembark-truck driver4 truck5 s3)
   deleted: (driving driver4 truck5)
   added: (at driver4 s3) (empty truck5)
   goals met: 10 of 13
55. (disembark-truck driver2 truck4 s3)
   deleted: (driving driver2 truck4)
   added: (at driver2 s3) (empty truck4)
   goals met: 11 of 13
56. (disembark-truck driver1 truck6 s5)
   deleted: (driving driver1 truck6)
   added: (at driver1 s5) (empty truck6)
   goals met: 11 of 13
57. (board-truck driver2 truck4 s3)
   deleted: (at driver2 s3) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 10 of 13
58. (drive-truck truck4 s3 s2 driver2)
   deleted: (at truck4 s3)
   added: (at truck4 s2)
   changed: (driven) from 1351 to 1396
   goals met: 11 of 13
59. (disembark-truck driver2 truck4 s2)
   deleted: (driving driver2 truck4)
   added: (at driver2 s2) (empty truck4)
   goals met: 11 of 13
60. (board-truck driver4 truck3 s3)
   deleted: (at driver4 s3) (empty truck3)
   added: (driving driver4 truck3)
   goals met: 11 of 13
61. (drive-truck truck3 s3 s2 driver4)
   deleted: (at truck3 s3)
   added: (at truck3 s2)
   changed: (driven) from 1396 to 1441
   goals met: 10 of 13
62. (board-truck driver2 truck4 s2)
   deleted: (at driver2 s2) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 10 of 13
63. (drive-truck truck3 s2 s3 driver4)
   deleted: (at truck3 s2)
   added: (at truck3 s3)
   changed: (driven) from 1441 to 1486
   goals met: 11 of 13
64. (drive-truck truck4 s2 s1 driver2)
   deleted: (at truck4 s2)
   added: (at truck4 s1)
   changed: (driven) from 1486 to 1524
   goals met: 10 of 13
65. (drive-truck truck3 s3 s0 driver4)
   deleted: (at truck3 s3)
   added: (at truck3 s0)
   changed: (driven) from 1524 to 1571
   goals met: 9 of 13
66. (drive-truck truck3 s0 s1 driver4)
   deleted: (at truck3 s0)
   added: (at truck3 s1)
   changed: (driven) from 1571 to 1641
   goals met: 9 of 13
67. (disembark-truck driver2 truck4 s1)
   deleted: (driving driver2 truck4)
   added: (at driver2 s1) (empty truck4)
   goals met: 9 of 13
68. (drive-truck truck3 s1 s2 driver4)
   deleted: (at truck3 s1)
   added: (at truck3 s2)
   changed: (driven) from 1641 to 1679
   goals met: 9 of 13
69. (board-truck driver2 truck4 s1)
   deleted: (at driver2 s1) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 9 of 13
70. (disembark-truck driver4 truck3 s2)
   deleted: (driving driver4 truck3)
   added: (at driver4 s2) (empty truck3)
   goals met: 9 of 13
71. (drive-truck truck4 s1 s2 driver2)
   deleted: (at truck4 s1)
   added: (at truck4 s2)
   changed: (driven) from 1679 to 1717
   goals met: 10 of 13
72. (walk driver4 s2 p1-2)
   deleted: (at driver4 s2)
   added: (at driver4 p1-2)
   changed: (walked) from 316 to 411
   goals met: 10 of 13
73. (walk driver4 p1-2 s1)
   deleted: (at driver4 p1-2)
   added: (at driver4 s1)
   changed: (walked) from 411 to 492
   goals met: 11 of 13
74. (disembark-truck driver2 truck4 s2)
   deleted: (driving driver2 truck4)
   added: (at driver2 s2) (empty truck4)
   goals met: 11 of 13
75. (board-truck driver2 truck3 s2)
   deleted: (at driver2 s2) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 11 of 13
76. (drive-truck truck3 s2 s3 driver2)
   deleted: (at truck3 s2)
   added: (at truck3 s3)
   changed: (driven) from 1717 to 1762
   goals met: 12 of 13
77. (disembark-truck driver2 truck3 s3)
   deleted: (driving driver2 truck3)
   added: (at driver2 s3) (empty truck3)
   goals met: 13 of 13
